{
	"about": {
		"description": "Étant motivé à l'idée d'apprendre la langue du pays du soleil levant, j'ai créé une petite page web n'ayant que pour unique objectif la génération aléatoire de \"Romaji\". Ainsi, je pouvais m'entraîner à réécrire le Romaji affiché en Hiragana & Katakana. Pourquoi ? Pour ne pas toujours les écrire dans l'ordre traditionnel (a, i, u, e, o) et ainsi être sûr de les connaître réellement.<br/><br/>Une fois la page web achevée, mes amis m'ont dit que ça serait bien si on pouvait voir la réponse (convertir le romaji en kana), avoir une barre de progression, choisir uniquement les Hiraganas ou Katakanas et bien d'autres choses.<br/><br/> En me disant que ça me permettrait de m'occuper, j'ai bien entendu suivi ces conseils et ai amélioré progressivement le module de génération. Contemplant mon petit module de génération tout mignon, une pensée me vint à l'esprit : finalement, n'y a-t-il pas moyen de faire un beau site, en ajoutant plein de modules, entièrement dédiés à l'apprentissage du Japonais ? Peut-être bien que si...",
		"subtitle": "Informations sur Zukagen",
		"title": "À PROPOS"
	},
	"tab": {
		"title": "SYLLABAIRE",
		"description": "Tableau reprenant les différents Kanas japonais. Pour chaque case, le Hiragana est à gauche, le Katakana à droite et le Romaji en bas."	
	},
	"gen": {
		"title": "GENERATEUR DE ROMAJI",
		"diacritics": "Diacritiques",
		"digraphs": "Digraphes",
		"explaination": "Génère les 46 signes japonais de base en \"Rōmaji\" dans un ordre aléatoire. Chaque signe n'apparaîtra qu'une fois jusqu'à réinitialisation de la liste.<br/>Le but est de s'entraîner à écrire le Katakana ou Hiragana du Rōmaji correspondant. La génération aléatoire permet d'éviter le par cœur (a, i, u, e, o, ...)<br/>Cliquez sur le \"Rōmaji\" pour afficher la solution !",
		"generate": "Générer",
		"reinitialize": "Réinitialiser",
		"time": "Temps :"
	},
	"home": {
		"discover": "Découvrir",
		"genDescription": "Module générant de manière aléatoire les 46 signes Japonais de base. Pour chaque \"Romaji\", l'objectif est d'écrire sa version Katakana / Hiragana.",
		"kanjisDescription": "Module présentant des \"Kanjis\" et leur signification ainsi que des Quizz pour s'entraîner. Bientôt disponible...",
		"readDescription": "Module présentant des \"mots\" de quelques kanas générés aléatoirement à réécrire en \"Romaji\".",
		"title": "Une solution <span class='evidence'>simple</span><br/>pour apprendre le Japonais"
	},
	"nav": {
		"about": "À propos",
		"tables": "Syllabaire",
		"credit": "Créé par Zukaryo",
		"generator": "Générateur",
		"home": "Accueil",
		"language": "Langue",
		"license": "Tous droits réservés © 2021",
		"logs": "Journal",
		"read": "Lecture",
		"readEasy": "Facile",
		"readMedium": "Intermédiaire"
	},
	"read": {
		"title": "LECTURE DE KANAS",
		"titleEasy": "LECTURE DE KANAS (SIMPLIFIÉE)",
		"description": "Ecrivez en Romaji les kanas visibles ci-dessous.",
		"founds": "Trouvés",
		"mistakes": "Fautes",
		"wpm":"Mots/min"
	}
}
